<template>
     <div class="wrapper">
    <ul class="content">
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>
       <li>{分类互敬$]*100 </li>

    </ul>
     </div>
    
</template>

<script>
 import BScorll from 'better-scroll'
export default {
    name:'cate',
    data(){
        return {
            scroll:null
        }
    },
    mounted(){
       this.scroll = new BScorll(document.querySelector('.wrapper'),{
           probeType:3,
           pullUpLoad:true
        })
        this.scroll.on('scroll',(position)=>{
            console.log(position)
        })
        this.scroll.on('pullingUp',()=>{
            console.log('上拉加载更多')
        })
    }
}
</script>

<style scoped>
    .wrapper{
        height: 200px;
        background-color: red;
        overflow: hidden;
    }
</style>